Revit 2027 API
InCanvasControlData(String) Constructor
 Constructs an InCanvasControlData with specific values assigned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InCanvasControlData(
	string imagePath
)
Public Sub New (
	imagePath As String
)
public:
InCanvasControlData(
	String^ imagePath
)
new :
        imagePath : string -> InCanvasControlData
Parameters
imagePath String
 File path with the image to be used. This must be an absolute path to a location on disk.
Exceptions
Exception | Condition
ArgumentException |  The file format specified by imagePath is an unsupported format - only *.bmp files are supported. -or- The file path specified by imagePath is not absolute.
ArgumentNullException |  A non-optional argument was null
FileArgumentNotFoundException |  The file specified by imagePath doesn't exist.
See Also
Reference
InCanvasControlData Class
InCanvasControlData Overload
Autodesk.Revit.DB Namespace